# More String Method - .strip() .lstrip() and .rstrip()

In [1]:
import pandas as pd

In [2]:
chicago = pd.read_csv('chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.tail(n=3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [4]:
chicago['Name'].str.title()

0            Aaron,  Elvia J
1          Aaron,  Jeffery M
2             Aaron,  Karina
3        Aaron,  Kimberlei R
4        Abad Jr,  Vicente M
                ...
32057    Zygadlo,  Michael J
32058     Zygowicz,  Peter J
32059      Zymantas,  Mark E
32060    Zyrkowski,  Carlo E
32061    Zyskowski,  Dariusz
Name: Name, Length: 32062, dtype: object

In [5]:
chicago['Name'] = chicago['Name'].str.title()

In [6]:
'            Hello World        '.rstrip()

'            Hello World'

In [7]:
'            Hello World        '.lstrip()

'Hello World        '

In [8]:
'            Hello World        '.strip()

'Hello World'

In [9]:
chicago.head(n=1)

              Name    Position Title   Department Employee Annual Salary
0  Aaron,  Elvia J  WATER RATE TAKER  WATER MGMNT              $90744.00

In [20]:
chicago['Position Title'] = chicago['Position Title'].str.strip().str.title()

In [11]:
chicago['Name'] = chicago['Name'].str.strip()

In [12]:
chicago['Department'] = chicago['Department'].str.title().str.strip()

In [13]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].str.replace('$',"")

C:\Users\Tom\AppData\Local\Temp\ipykernel_108\108503866.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].str.replace('$',"")

In [14]:
chicago.head(n=2)

                Name    Position Title   Department Employee Annual Salary
0    Aaron,  Elvia J  WATER RATE TAKER  Water Mgmnt               90744.00
1  Aaron,  Jeffery M    POLICE OFFICER       Police               84450.00

In [15]:
chicago.info

<bound method DataFrame.info of                       Name                  Position Title        Department  \
0          Aaron,  Elvia J                WATER RATE TAKER       Water Mgmnt
1        Aaron,  Jeffery M                  POLICE OFFICER            Police
2           Aaron,  Karina                  POLICE OFFICER            Police
3      Aaron,  Kimberlei R        CHIEF CONTRACT EXPEDITER  General Services
4      Abad Jr,  Vicente M               CIVIL ENGINEER IV       Water Mgmnt
...                    ...                             ...               ...
32057  Zygadlo,  Michael J  FRM OF MACHINISTS - AUTOMOTIVE  General Services
32058   Zygowicz,  Peter J                  POLICE OFFICER            Police
32059    Zymantas,  Mark E                  POLICE OFFICER            Police
32060  Zyrkowski,  Carlo E                  POLICE OFFICER            Police
32061  Zyskowski,  Dariusz         CHIEF DATA BASE ANALYST              Doit

      Employee Annual Salary
0                   90744.00
1                   84450.00
2                   84450.00
3                   89880.00
4                  106836.00
...                      ...
32057               99528.00
32058               87384.00
32059               84450.00
32060               87384.00
32061              113664.00

[32062 rows x 4 columns]>

In [16]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1.2+ MB

In [17]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].astype(float)

In [18]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  float64
dtypes: float64(1), object(3)
memory usage: 1.2+ MB

In [21]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,90744.0
1,"Aaron, Jeffery M",Police Officer,Police,84450.0
2,"Aaron, Karina",Police Officer,Police,84450.0
3,"Aaron, Kimberlei R",Chief Contract Expediter,General Services,89880.0
4,"Abad Jr, Vicente M",Civil Engineer Iv,Water Mgmnt,106836.0